template/example/call-seur.xml

<?xml version="1.0" encoding="utf-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:imp="http://localhost:7026/ImprimirECBWebService">
   <soapenv:Header/>
   <soapenv:Body>
      <imp:impresionIntegracionConECBWS>
         <imp:in0>WSTESTSEUR</imp:in0>
         <imp:in1>TESTSEURWS</imp:in1>
         <imp:in2>ZEBRA</imp:in2>
         <imp:in3>LP2844-Z</imp:in3>
         <imp:in4>2C</imp:in4>
         <imp:in5><![CDATA[<?xml version="1.0" encoding="ISO-8859-1"?>
<root><exp><bulto><ci>7000</ci>
<nif>A61587358</nif>
<ccc>40611</ccc>
<servicio>1</servicio>
<producto>2</producto>
<total_bultos>1</total_bultos>
<total_kilos>14</total_kilos>
<pesoBulto>14.0000</pesoBulto>
<observaciones>observaciones</observaciones>
<referencia_expedicion>PRUEBAS SEUR PEDRO</referencia_expedicion>
<ref_bulto>Test_repaimnet</ref_bulto>
<clavePortes>f</clavePortes>
<clavePod></clavePod>
<claveReembolso>F</claveReembolso>
<valorReembolso>100.50</valorReembolso>
<nombre_consignatario>Pedro Mora</nombre_consignatario>
   <direccion_consignatario>Cal Nyepa, 23</direccion_consignatario>
   <tipoVia_consignatario>CL</tipoVia_consignatario>
   <tNumVia_consignatario>N</tNumVia_consignatario>
   <numVia_consignatario>.</numVia_consignatario>
   <escalera_consignatario>.</escalera_consignatario>
   <piso_consignatario>.</piso_consignatario>
   <puerta_consignatario>.</puerta_consignatario>
   <poblacion_consignatario>Barcelona</poblacion_consignatario>
   <codPostal_consignatario>08001</codPostal_consignatario>
   <pais_consignatario>es</pais_consignatario>
   <email_consignatario>pedro.mora@seur.net</email_consignatario>
   <telefono_consignatario>670231944</telefono_consignatario>
<tipo_mercancia></tipo_mercancia>
<clave_aduana_origen></clave_aduana_origen>
<clave_aduana_destino></clave_aduana_destino>
<valor_declarado></valor_declarado>
</bulto></exp></root>
]]></imp:in5>
            <imp:in6>fichero.xml</imp:in6>
            <imp:in7>A61587358</imp:in7>
            <imp:in8>8</imp:in8>
            <imp:in9>-1</imp:in9>
            <imp:in10>WebService</imp:in10>
        </imp:impresionIntegracionConECBWS>
    </soapenv:Body>
</soapenv:Envelope>